MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_aes.h
  * @brief   Header file of AES HAL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_HAL_AES_H
#define STM32C5XX_HAL_AES_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_rng.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined(AES) || defined(SAES)
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
    || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1)) \
    || (defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1))\
    || (defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1))
/** @defgroup AES AES
  * @{
  */

/* Exported constants ---------------------------------------------------------*/
/** @defgroup AES_Exported_Constants HAL AES Constants
  * @{
  */

#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)

/** @defgroup  AES_Error_Code Error Code definition reflecting the process asynchronous errors
  * @{
  */
#define  HAL_AES_ERROR_NONE   (0UL)             /*!< No error    */
#define  HAL_AES_ERROR_KEY    AES_ISR_KEIF      /*!< Key error   */
#if defined(SAES)
#define  HAL_AES_ERROR_RNG    AES_ISR_RNGEIF    /*!< RNG error   */
#endif /* SAES */
#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
#define  HAL_AES_ERROR_DMA    (0x01UL << 4U)    /*!< DMA error   */
#endif /* USE_HAL_AES_DMA */
#define  HAL_AES_ERROR_READ   AES_SR_RDERRF      /*!< Read error  */
#define  HAL_AES_ERROR_WRITE  AES_SR_WRERRF      /*!< Write error */

/**
  * @}
  */

#endif /* USE_HAL_AES_GET_LAST_ERRORS */

/*! AES flag  definition */
#define HAL_AES_FLAG_BUSY     AES_SR_BUSY                 /*!< Process suspension forbidden
                                                               also set when transferring a shared key
                                                               from SAES peripheral
                                                               */
#define HAL_AES_FLAG_WRERR    (AES_SR_WRERRF | 0x80000000U) /*!< Write Error flag */
#define HAL_AES_FLAG_RDERR    (AES_SR_RDERRF | 0x80000000U) /*!< Read error  flag */
#define HAL_AES_FLAG_KEYVALID AES_SR_KEYVALID              /*!< Key valid flag */
#define HAL_AES_FLAG_CC       AES_ISR_CCF                  /*!< Computation completed flag */
#define HAL_AES_FLAG_KERR     AES_ISR_KEIF                 /*!< Key error interrupt flag */
#define HAL_AES_FLAG_RDWRERR  AES_ISR_RWEIF                /*!< Read or write error interrupt flag */
#if defined(SAES)
#define HAL_AES_FLAG_RNGERR   AES_ISR_RNGEIF               /*!< RNG error interrupt flag */
#endif /* SAES */

/*! AES key interrupts definition */
#define HAL_AES_IT_CC       AES_IER_CCFIE  /*!< Computation Complete interrupt enable */
#define HAL_AES_IT_RDWRERR  AES_IER_RWEIE  /*!< Read or write Error interrupt enable  */
#define HAL_AES_IT_KERR     AES_IER_KEIE   /*!< Key error interrupt enable */
#define HAL_AES_IT_ALL (HAL_AES_IT_CC | HAL_AES_IT_RDWRERR | HAL_AES_IT_KERR) /*!< AES Interrupt Enable */
#if defined(SAES)
#define HAL_AES_IT_RNGERR   AES_IER_RNGEIE /*!< RNG error interrupt enable */
#endif /* SAES */
/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup  AES_Exported_Types HAL AES Types
  * @{
  */

/*! AES instance enumeration definition */
typedef enum
{
  HAL_AES = AES_BASE, /*!< AES  instance */
#if defined(SAES)
  HAL_SAES = SAES_BASE /*!< SAES instance */
#endif /* SAES */
} hal_aes_t;

/*! AES Global state enumeration definition */
typedef enum
{
  HAL_AES_STATE_RESET     = 0UL,          /*!< AES peripheral is not yet initialized */
  HAL_AES_STATE_INIT      = (1UL << 31U), /*!< AES peripheral is initialized but not yet configured */
  HAL_AES_STATE_IDLE      = (1UL << 30U), /*!< AES peripheral is initialized and configured */
  HAL_AES_STATE_ACTIVE    = (1UL << 29U), /*!< AES internal processing is ongoing */
#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
  HAL_AES_STATE_SUSPENDED = (1UL << 28U)  /*!< AES internal processing is suspended */
#endif /* USE_HAL_AES_SUSPEND_RESUME */
} hal_aes_state_t;

/*! AES key size enumeration definition */
typedef enum
{
  HAL_AES_KEY_SIZE_128BIT = 0x00000000U,   /*!< 128-bit long key */
  HAL_AES_KEY_SIZE_256BIT = AES_CR_KEYSIZE /*!< 256-bit long key */
} hal_aes_key_size_t;

#if defined(SAES)
/*! AES key select enumeration definition */
typedef enum
{
  HAL_AES_KEY_SELECT_DHUK         = AES_CR_KEYSEL_0, /*!< Only for SAES, hardware key: Derived hardware unique key
                                                       (DHUK 256-bit) */
  HAL_AES_KEY_SELECT_BHK          = AES_CR_KEYSEL_1, /*!< Only for SAES, software key:Boot hardware key BHK (256-bit) */
  HAL_AES_KEY_SELECT_DHUK_XOR_BHK = AES_CR_KEYSEL_2  /*!< Only for SAES, hardware unique key XOR software key */
} hal_aes_key_select_t;


/*! AES key mode enumeration definition */
typedef enum
{
  HAL_AES_KEY_MODE_NORMAL  = 0x00000000U,   /*!< Use HW key to do encrypt/decrypt in normal key mode */
  HAL_AES_KEY_MODE_WRAPPED = AES_CR_KMOD_0, /*!< Use HW key to do encrypt/decrypt in wrap key mode   */
  HAL_AES_KEY_MODE_SHARED  = AES_CR_KMOD_1  /*!< Use HW key to do encrypt/decrypt in share key mode  */
} hal_aes_key_mode_t;
#endif /* SAES */

/*! AES data swapping enumeration definition */
typedef enum
{
  HAL_AES_DATA_SWAPPING_NO       = 0x00000000U,       /*!< No swapping        */
  HAL_AES_DATA_SWAPPING_HALFWORD = AES_CR_DATATYPE_0, /*!< Half-word swapping */
  HAL_AES_DATA_SWAPPING_BYTE     = AES_CR_DATATYPE_1, /*!< Byte swapping      */
  HAL_AES_DATA_SWAPPING_BIT      = AES_CR_DATATYPE    /*!< Bit swapping       */
} hal_aes_data_swapping_t;

#if defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)
/*! AES GCM_GMAC configuration structure */
typedef struct
{
  uint32_t *p_init_vect;      /*!< The initialization vector */

  uint32_t *p_header;         /*!< Used only in AES GCM and CCM Algorithm for authentication,
                                   For GCM: The header is also known as Additional Authentication Data */
  uint32_t header_size_byte ; /*!< The size of header buffer in bytes */

} hal_aes_gcm_config_t;
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */

#if defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1)
/*! AES CCM configuration structure */
typedef struct
{
  uint32_t *p_b0;             /*!< B0 is the first authentication block used only in AES CCM mode, composed of 16 bytes */

  uint32_t *p_header;         /*!< Used only in AES GCM and CCM Algorithm for authentication,
                                   For CCM: Named B1 composed of the associated data length and Associated Data. */

  uint32_t header_size_byte ; /*!< The size of header buffer in bytes */

} hal_aes_ccm_config_t;
#endif /* USE_HAL_AES_GCM_GMAC_ALGO or USE_HAL_AES_CCM_ALGO */

