MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.h
  const uint32_t            *p_key;           /*!< Application pointer key to be stored in the handle during
                                                   suspension */
#endif /* USE_HAL_AES_SUSPEND_RESUME */

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
  hal_aes_cb_t               p_in_cplt_cb;      /*!< AES Input FIFO transfer completed callback  */
  hal_aes_cb_t               p_out_cplt_cb;     /*!< AES Output FIFO transfer completed callback */
  hal_aes_cb_t               p_error_cb;        /*!< AES Error callback */
#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
  hal_aes_cb_t               p_suspend_cb;      /*!< AES Suspend callback */
#endif /* USE_HAL_AES_SUSPEND_RESUME */
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

} hal_aes_save_context_t;
#endif /* USE_HAL_AES_SUSPEND_RESUME */

/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/
/** @defgroup AES_Exported_Functions HAL AES Functions
  * @{
  */

/** @defgroup AES_Exported_Functions_Group1 Initialization and De-initialization functions
  * @{
  */
hal_status_t HAL_AES_Init(hal_aes_handle_t *haes, hal_aes_t instance);
void HAL_AES_DeInit(hal_aes_handle_t *haes);
/**
  * @}
  */

/** @defgroup AES_Exported_Functions_Group2 Configuration functions
  * @{
  */
#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
hal_status_t HAL_AES_ECB_SetConfig(hal_aes_handle_t *haes);
hal_status_t HAL_AES_CBC_SetConfig(hal_aes_handle_t *haes, const uint32_t *p_init_vect);
#endif /* USE_HAL_AES_ECB_CBC_ALGO */

#if defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1)
hal_status_t HAL_AES_CTR_SetConfig(hal_aes_handle_t *haes, const uint32_t *p_init_vect);
#endif /* USE_HAL_AES_CTR_ALGO */

#if defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)
hal_status_t HAL_AES_GCM_GMAC_SetConfig(hal_aes_handle_t *haes, const hal_aes_gcm_config_t *p_config);
#endif /* USE_HAL_AES_GCM_GMAC_ALGO */

#if defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1)
hal_status_t HAL_AES_CCM_SetConfig(hal_aes_handle_t *haes, const hal_aes_ccm_config_t *p_config);
#endif /* USE_HAL_AES_CCM_ALGO */

hal_status_t HAL_AES_SetNormalKey(hal_aes_handle_t *haes, hal_aes_key_size_t key_size, const uint32_t *p_key);

#if defined(SAES)
hal_status_t HAL_AES_SetSharedKey(hal_aes_handle_t *haes, hal_aes_key_size_t key_size);
hal_status_t HAL_AES_SetHWKey(hal_aes_handle_t *haes, hal_aes_key_size_t key_size, hal_aes_key_select_t key_select,
                              hal_aes_key_mode_t key_mode);
#endif /* SAES */

hal_status_t HAL_AES_SetDataSwapping(hal_aes_handle_t *haes, hal_aes_data_swapping_t data_swapping);
hal_aes_data_swapping_t HAL_AES_GetDataSwapping(const hal_aes_handle_t *haes);
/**
  * @}
  */

/** @defgroup AES_Exported_Functions_Group3 Process functions
  * @{
  */
/* encryption/decryption */
hal_status_t HAL_AES_Encrypt(hal_aes_handle_t *haes, const void *p_input, uint16_t size_byte, void *p_output,
                             uint32_t timeout_ms);
hal_status_t HAL_AES_Decrypt(hal_aes_handle_t *haes, const void *p_input, uint16_t size_byte, void *p_output,
                             uint32_t timeout_ms);
hal_status_t HAL_AES_Encrypt_IT(hal_aes_handle_t *haes, const void *p_input, uint16_t size_byte, void *p_output);
hal_status_t HAL_AES_Decrypt_IT(hal_aes_handle_t *haes, const void *p_input, uint16_t size_byte, void *p_output);
#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
hal_status_t HAL_AES_Encrypt_DMA(hal_aes_handle_t *haes, const void *p_input, uint16_t size_byte, void *p_output);
hal_status_t HAL_AES_Decrypt_DMA(hal_aes_handle_t *haes, const void *p_input, uint16_t size_byte, void *p_output);
#endif /* USE_HAL_AES_DMA */

#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
hal_status_t HAL_AES_RequestSuspend(hal_aes_handle_t *haes);
hal_status_t HAL_AES_SaveContext(hal_aes_handle_t *haes, hal_aes_save_context_t *p_context);
hal_status_t HAL_AES_RestoreContext(hal_aes_handle_t *haes, const hal_aes_save_context_t *p_context);
hal_status_t HAL_AES_Resume(hal_aes_handle_t *haes);
#endif /* defined (USE_HAL_AES_SUSPEND_RESUME) */
/**
  * @}
  */

/** @defgroup AES_Exported_Functions_Group4 IRQHandler,Callbacks and, Link DMA functions
  * @{
  */
void HAL_AES_IRQHandler(hal_aes_handle_t *haes);

void HAL_AES_InCpltCallback(hal_aes_handle_t *haes);
void HAL_AES_OutCpltCallback(hal_aes_handle_t *haes);
void HAL_AES_ErrorCallback(hal_aes_handle_t *haes);
#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
void HAL_AES_SuspendCallback(hal_aes_handle_t *haes);
#endif /* defined (USE_HAL_AES_SUSPEND_RESUME) */

#if defined(USE_HAL_AES_REGISTER_CALLBACKS) && (USE_HAL_AES_REGISTER_CALLBACKS == 1)
hal_status_t HAL_AES_RegisterInTransferCpltCallback(hal_aes_handle_t *haes, hal_aes_cb_t p_callback);
hal_status_t HAL_AES_RegisterOutTransferCpltCallback(hal_aes_handle_t *haes, hal_aes_cb_t p_callback);
hal_status_t HAL_AES_RegisterErrorCallback(hal_aes_handle_t *haes, hal_aes_cb_t p_callback);
#if defined(USE_HAL_AES_SUSPEND_RESUME) && (USE_HAL_AES_SUSPEND_RESUME == 1)
hal_status_t HAL_AES_RegisterSuspendCallback(hal_aes_handle_t *haes, hal_aes_cb_t p_callback);
#endif /* defined (USE_HAL_AES_SUSPEND_RESUME) */
#endif /* (USE_HAL_AES_REGISTER_CALLBACKS) */

#if defined(USE_HAL_AES_DMA) && (USE_HAL_AES_DMA == 1)
hal_status_t HAL_AES_SetInDMA(hal_aes_handle_t *haes, hal_dma_handle_t *hdma_in);
hal_status_t HAL_AES_SetOutDMA(hal_aes_handle_t *haes, hal_dma_handle_t *hdma_out);
#endif /* USE_HAL_AES_DMA */
/**
  * @}
  */

/** @defgroup AES_Exported_Functions_Group5 Peripheral State, Error and Get last IV functions
  * @{
  */
hal_aes_state_t HAL_AES_GetState(const hal_aes_handle_t *haes);
#if defined(USE_HAL_AES_GET_LAST_ERRORS) && (USE_HAL_AES_GET_LAST_ERRORS == 1)
uint32_t HAL_AES_GetLastErrorCodes(const hal_aes_handle_t *haes);
#endif /* USE_HAL_AES_GET_LAST_ERRORS */

#if defined(USE_HAL_AES_USER_DATA) && (USE_HAL_AES_USER_DATA == 1)
void HAL_AES_SetUserData(hal_aes_handle_t *haes, const void *p_user_data);
const void *HAL_AES_GetUserData(const hal_aes_handle_t *haes);
#endif /* (USE_HAL_AES_USER_DATA) */
#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
hal_status_t HAL_AES_CBC_GetLastOutputIV(const hal_aes_handle_t *haes, const uint8_t *p_last_iv, uint8_t last_iv_size);
#endif /* USE_HAL_AES_ECB_CBC_ALGO*/
#if (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
hal_status_t HAL_AES_CTR_GetLastOutputIV(const hal_aes_handle_t *haes, const uint8_t *p_last_iv, uint8_t last_iv_size);
#endif /*USE_HAL_AES_CTR_ALGO */
/**
  * @}
  */

/** @defgroup AES_Exported_Functions_Group6 Tag Generating functions
  * @{
  */

#if defined(USE_HAL_AES_GCM_GMAC_ALGO) && (USE_HAL_AES_GCM_GMAC_ALGO == 1)
hal_status_t HAL_AES_GCM_GenerateAuthTAG(hal_aes_handle_t *haes, uint32_t *p_auth_tag, uint32_t timeout_ms);
#endif /* (USE_HAL_AES_GCM_GMAC_ALGO) */

#if defined(USE_HAL_AES_CCM_ALGO) && (USE_HAL_AES_CCM_ALGO == 1)
hal_status_t HAL_AES_CCM_GenerateAuthTAG(hal_aes_handle_t *haes, uint32_t *p_auth_tag, uint32_t timeout_ms);
#endif /* (USE_HAL_AES_CCM_ALGO) */

/**
  * @}
  */

#if defined(SAES)
/** @defgroup AES_Exported_Functions_Group7 AES Processing Key functions
  * @{
  */
#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
/* Wrap key function */
hal_status_t HAL_AES_WrapKey(hal_aes_handle_t *haes, const uint32_t *p_key_in, hal_aes_key_size_t key_size,
                             uint32_t *p_key_output, uint32_t timeout_ms);
#endif /* USE_HAL_AES_ECB_CBC_ALGO */
#if (defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)) \
    || (defined(USE_HAL_AES_CTR_ALGO) && (USE_HAL_AES_CTR_ALGO == 1))
/* Unwrap key function */
hal_status_t HAL_AES_UnwrapKey(hal_aes_handle_t *haes, const uint32_t *p_key_in, hal_aes_key_size_t key_size,
                               uint32_t timeout_ms);
#endif /* USE_HAL_AES_ECB_CBC_ALGO || USE_HAL_AES_CTR_ALGO */
#if defined(USE_HAL_AES_ECB_CBC_ALGO) && (USE_HAL_AES_ECB_CBC_ALGO == 1)
/* Encrypt and Decrypt Shared key functions */
hal_status_t HAL_AES_EncryptSharedKey(hal_aes_handle_t *haes, const uint32_t *p_key_in, hal_aes_key_size_t key_size,
                                      uint32_t *p_key_output, uint32_t target_id, uint32_t timeout_ms);
hal_status_t HAL_AES_DecryptSharedKey(hal_aes_handle_t *haes, const uint32_t *p_key_in, hal_aes_key_size_t key_size,
                                      uint32_t target_id, uint32_t timeout_ms);
#endif /* USE_HAL_AES_ECB_CBC_ALGO */
/**
  * @}
  */
#endif /* SAES */

/** @defgroup AES_Exported_Functions_Group8 Static Inlines functions
  * @{
This section provides functions allowing to manage AES interrupts and flags:
  - HAL_AES_GetFlag():Allowing to return the state of a flag
  - HAL_AES_ClearFlagRDWRERR():Allowing to clear the read/write error flag
  - HAL_AES_ClearFlagCC():Allowing to clear the computation complete flag
  - HAL_AES_ClearFlagKERR():Allowing to clear the invalid key error flag
#if defined(SAES)
  - HAL_AES_ClearFlagRNGERR():Allowing to clear the AES RNG error flag
#endif

  - HAL_AES_GetITSource():Allowing to return the state of an interrupt
  - HAL_AES_EnableIT():Allowing to enable an AES interrupt
  - HAL_AES_DisableIT():Allowing to disable an AES interrupt
  */
/** @brief  Check whether the specified AES status flag is set or not.
  * @param  haes Specifies the AES handle
  * @param  flag Specifies the flag to check, this parameter can be one of the following values:
  *            @arg @ref HAL_AES_FLAG_KEYVALID Key valid flag
  *            @arg @ref HAL_AES_FLAG_BUSY GCM process suspension forbidden or transferring a shared key from SAES IP.
  *            @arg @ref HAL_AES_FLAG_WRERR Write Error flag
  *            @arg @ref HAL_AES_FLAG_RDERR Read Error flag
  *            @arg @ref HAL_AES_FLAG_CC Computation Complete flag
  *            @arg @ref HAL_AES_FLAG_KERR Key error flag
  *            @arg @ref HAL_AES_FLAG_RDWRERR Read/write Error flag
#if defined(SAES)
  *            @arg @ref HAL_AES_FLAG_RNGERR RNG Error flag
#endif

  * @retval uint32_t The state of flag (0 or 1).
  */

__STATIC_INLINE uint32_t HAL_AES_GetFlag(const hal_aes_handle_t *haes, uint32_t flag)
{
  uint32_t status;

  if ((flag == (uint32_t)HAL_AES_FLAG_KEYVALID) || (flag == (uint32_t)HAL_AES_FLAG_BUSY)
      || (flag == (uint32_t)HAL_AES_FLAG_WRERR) || (flag == (uint32_t)HAL_AES_FLAG_RDERR))
  {
    status = ((STM32_READ_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->SR,
                              (flag & 0x7FFFFFFFU)) == (flag & 0x7FFFFFFFU)) ? 1U : 0U);
  }
#if defined(SAES)
  else if ((flag == (uint32_t)HAL_AES_FLAG_CC) || (flag == (uint32_t)HAL_AES_FLAG_KERR)
           || (flag == (uint32_t)HAL_AES_FLAG_RDWRERR) || (flag == (uint32_t)HAL_AES_FLAG_RNGERR))
#else
  else if ((flag == (uint32_t)HAL_AES_FLAG_CC) || (flag == (uint32_t)HAL_AES_FLAG_KERR)
           || (flag == (uint32_t)HAL_AES_FLAG_RDWRERR))
#endif /* SAES */
  {
    status = ((STM32_READ_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->ISR, flag) == flag) ? 1U : 0U);
  }
  else
  {
    status = 0;
  }
  return (status);
}

/** @brief  Clear the AES Read/write error flag.
  * @param  haes Specifies the AES handle
  */
__STATIC_INLINE void HAL_AES_ClearFlagRDWRERR(hal_aes_handle_t *haes)
{
  STM32_SET_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->ICR, AES_ICR_RWEIF);
}

/** @brief  Clear the AES computation complete flag.
  * @param  haes Specifies the AES handle
  */
__STATIC_INLINE void HAL_AES_ClearFlagCC(hal_aes_handle_t *haes)
{
  STM32_SET_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->ICR, AES_ICR_CCF);
}

