MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_aes.h
/** @brief  Clear the AES invalid key error flag.
  * @param  haes Specifies the AES handle
  */
__STATIC_INLINE void HAL_AES_ClearFlagKERR(hal_aes_handle_t *haes)
{
  STM32_SET_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->ICR, AES_ICR_KEIF);
}

#if defined(SAES)
/** @brief  Clear the AES RNG error flag.
  * @param  haes Specifies the AES handle
  */
__STATIC_INLINE void HAL_AES_ClearFlagRNGERR(hal_aes_handle_t *haes)
{
  STM32_SET_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->ICR, AES_ICR_RNGEIF);
}
#endif /* SAES */

/** @brief  Check whether the specified AES interrupt source is enabled or not.
  * @param  haes      Specifies the AES handle
  * @param  interrupt AES interrupt source to check
  *         This parameter can be one of the following values:
  *            @arg @ref HAL_AES_IT_RDWRERR Error interrupt (used for RDERR and WRERR)
  *            @arg @ref HAL_AES_IT_CC Computation Complete interrupt
  *            @arg @ref HAL_AES_IT_KERR Key error interrupt
  *            @arg @ref HAL_AES_IT_RNGERR RNG error interrupt
  * @retval uint32_t State of interruption (0 or 1).
  */
__STATIC_INLINE uint32_t HAL_AES_GetITSource(const hal_aes_handle_t *haes, uint32_t interrupt)
{
  return ((STM32_READ_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->IER, (uint32_t)interrupt)
           == (uint32_t)interrupt) ? 1U : 0U);
}

/**
  * @brief  Enable the AES interrupt.
  * @param  haes      Specifies the AES handle
  * @param  interrupt AES Interrupt
  *         This parameter can be a combination of the following values:
  *            @arg @ref HAL_AES_IT_RDWRERR Error interrupt (used for RDERR and WRERR)
  *            @arg @ref HAL_AES_IT_CC Computation Complete interrupt
  *            @arg @ref HAL_AES_IT_KERR Key error interrupt
  *            @arg @ref HAL_AES_IT_RNGERR RNG error interrupt
  */
__STATIC_INLINE void HAL_AES_EnableIT(hal_aes_handle_t *haes, uint32_t interrupt)
{
  STM32_SET_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->IER, interrupt);
}

/**
  * @brief  Disable the AES interrupt.
  * @param  haes      Specifies the AES handle
  * @param  interrupt AES Interrupt
  *         This parameter can be a combination of the following values:
  *            @arg @ref HAL_AES_IT_RDWRERR Error interrupt (used for RDERR and WRERR)
  *            @arg @ref HAL_AES_IT_CC Computation Complete interrupt
  *            @arg @ref HAL_AES_IT_KERR Key error interrupt
  *            @arg @ref HAL_AES_IT_RNGERR RNG error interrupt
  */
__STATIC_INLINE void HAL_AES_DisableIT(hal_aes_handle_t *haes, uint32_t interrupt)
{
  STM32_CLEAR_BIT(((AES_TypeDef *)((uint32_t)haes->instance))->IER, interrupt);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* USE_HAL_AES_ECB_CBC_ALGO || USE_HAL_AES_CTR_ALGO || USE_HAL_AES_GCM_GMAC_ALGO || USE_HAL_AES_CCM_ALGO*/
#endif /* AES or SAES */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_HAL_AES_H */
